In [3]:
import pandas as pd
import numpy as np

In [9]:
l=['1',2,3]
m=np.array(l)
n={'a':1,'b':2}

In [13]:
print(pd.Series(l,m))
pd.Series(n)

1    1
2    2
3    3
dtype: object

a    1
b    2
dtype: int64

In [20]:
d={'a':[1,2,3,4],'b':[1,2,np.nan,np.nan]}
df=pd.DataFrame(d)
df

   a    b
0  1  1.0
1  2  2.0
2  3  NaN
3  4  NaN

In [22]:
df.dropna(axis=0,thresh=2)

   a    b
0  1  1.0
1  2  2.0

In [24]:
df.fillna('Keerthana')

   a          b
0  1          1
1  2          2
2  3  Keerthana
3  4  Keerthana

In [26]:
dat={'btech':[1,2,3],
    'mtech':[0,0,0],
    'phd':[1,2,3]}

In [27]:
dat

{'btech': [1, 2, 3], 'mtech': [0, 0, 0], 'phd': [1, 2, 3]}

In [30]:
df= pd.DataFrame(dat)
df

   btech  mtech  phd
0      1      0    1
1      2      0    2
2      3      0    3

In [33]:
group_btech=df.groupby('btech')
group_btech.mean()

       mtech  phd
btech
1          0    1
2          0    2
3          0    3

In [34]:
group_btech.std()

       mtech  phd
btech
1        NaN  NaN
2        NaN  NaN
3        NaN  NaN

In [35]:
df.describe()

       btech  mtech  phd
count    3.0    3.0  3.0
mean     2.0    0.0  2.0
std      1.0    0.0  1.0
min      1.0    0.0  1.0
25%      1.5    0.0  1.5
50%      2.0    0.0  2.0
75%      2.5    0.0  2.5
max      3.0    0.0  3.0